#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.template_file.cb_app: Reading...
tls_private_key.bastion: Refreshing state... [id=161a6b5e631c819356fdc2c450325e1b82ac853c]
data.template_file.cb_app: Read complete after 0s [id=20ec471f6ed508e1a9949f87acae01e2d35f79952e4a0a39aedf8687ad99f5a6]
aws_key_pair.bastion_key_pair: Refreshing state... [id=bastion-key-test]
aws_cloudwatch_log_group.cb_log_group: Refreshing state... [id=/ecs/cb-app]
aws_ssm_parameter.bastion_key_pair: Refreshing state... [id=/test/bastion/ssh-key]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/cb-cluster]
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
data.aws_secretsmanager_secret.github_token: Reading...
aws_iam_role.codebuild_service_role: Refreshing state... [id=codebuild-service-role]
data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
data.aws_availability_zones.available: Reading...
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
aws_iam_role.codedeploy_service_role: Refreshing state... [id=codedeploy-service-role]
data.aws_secretsmanager_secret.github_token: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN]
aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=myEcsAutoScaleRole]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240819081518024600000002]
aws_ecs_task_definition.app: Refreshing state... [id=cb-app-task]
aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-service-role:terraform-20240815121418521100000001]
data.aws_secretsmanager_secret_version.github_token_value: Reading...
aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240819081517975400000001]
aws_cloudwatch_log_stream.cb_log_stream: Refreshing state... [id=cb-log-stream]
aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-service-role:terraform-20240815121418543900000002]
aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=myEcsAutoScaleRole-20240816090310994000000001]
data.aws_secretsmanager_secret_version.github_token_value: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN|AWSCURRENT]
aws_codebuild_source_credential.github_credential: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:token/github]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_lb_target_group.blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/70c3c55ee01a7c7a]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_internet_gateway.gw: Refreshing state... [id=igw-0fb286c9a49c0be0d]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe80fa5495cb3632]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_subnet.public[0]: Refreshing state... [id=subnet-048eedd36dc7ac201]
aws_codebuild_project.application_build: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/application-build]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-01c3cdcddfa347799]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/main/ea7fde6e48daa652]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_route.internet_access: Refreshing state... [id=r-rtb-026c0f34bf1cafc1e1080289494]
aws_lb_listener.dev_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/main/ea7fde6e48daa652/c89b9cd66dca126c]
aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/cb-cluster/cb-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:eu-west-1:802288441694:service/cb-cluster/cb-service"
        name                               = "cb-service"
        tags                               = {}
        # (16 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "cb-app" -> null
          - container_port   = 80 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/70c3c55ee01a7c7a" -> null
        }
      + load_balancer {
          + container_name   = "cb-app"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb_listener.dev_listener will be updated in-place
  ~ resource "aws_lb_listener" "dev_listener" {
        id                = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/main/ea7fde6e48daa652/c89b9cd66dca126c"
      ~ port              = 80 -> 8081
        tags              = {}
        # (4 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/70c3c55ee01a7c7a" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.blue_tg must be replaced
-/+ resource "aws_lb_target_group" "blue_tg" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/70c3c55ee01a7c7a" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/blue-target-group/70c3c55ee01a7c7a" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/70c3c55ee01a7c7a" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "blue-target-group"
      ~ port                               = 80 -> 8081 # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (8 unchanged attributes hidden)

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*